Repository: jimregan/citizens-information-raw
Catalog: en-pl/www.citizensinformation.ie/pl/social_welfare/social_welfare_payments/social_welfare_payments_and_work/jobseekers_benefit_and_work.html.txt.tmx
Source language: en
Languages: pl

source: Earnings are assessed as gross income less allowable expenses over 12 months
pl: Zarobki szacuje się jako dochód brutto pomniejszony o dopuszczalne wydatki podlegające odliczeniu za okres 12 miesięcy

source: Annual earnings from self-employment are divided by 52 to find your weekly means from self-employment
pl: Roczne zarobki pochodzące z samozatrudnienia dzieli się przez 52, co daje średnie tygodniowe środki finansowe pochodzące z samozatrudnienia

source: Any ‘drawings’ you take from the business is not an allowable expense
pl: Żadne „pobrania” środków z działalności gospodarczej na własny użytek nie są dopuszczalnym wydatkiem podlegającym odliczeniu

source: Income from capital, for example, property, savings and investments, is included in the mean test
pl: W ocenie dochodów uwzględnia się dochody z kapitału, np. nieruchomości, oszczędności, inwestycji

source: Where capital is held jointly, half of the value is assessed as belonging to your spouse, civil partner or cohabitant
pl: W przypadku, gdy kapitał jest wspólny, połowa wartości zostaje uznana za mienie współmałżonka/partnera bądź konkubenta

source: You can find out more about how capital is assessed in the means test
pl: Poniżej przedstawiona jest formuła oceny środków finansowych uzyskiwanych z kapitału

source: Income from other sources
pl: Dochody z innych źródeł

source: Income from other sources includes rental income from the letting of property, income from an occupational pension, foreign social welfare payments, income from a trust fund, income under a deed of covenant and other cash income
pl: Dochody z innych źródeł obejmują dochody z wynajmowania nieruchomości, dochód emerytalny z zakładowych funduszy emerytalnych, wypłaty zagranicznych świadczeń socjalnych, dochód z funduszu powierniczego, dochód uzyskiwany na podstawie aktu zobowiązania, inne dochody gotówkowe, itd

source: It is calculated on a weekly basis
pl: Oblicza się je w ujęciu tygodniowym
